<P> <img src="https://i.ibb.co/gyNf19D/nhslogo.png" alt="nhslogo" border="0" width="100" align="right"><font size="6"><b> CS6131 Database Design</b> </font>

# Lab 5: Stored Program

### Connecting to the Database

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:admin@localhost/

In [3]:
# PrettyTable dependancy has deprecated the default style so needs to be explicitly configured
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

We are using the same company database from the previous lab. You need not reload the database if the database has been created properly in the last lab.

Run the query below to check that the data has been loaded correctly.

In [4]:
%%sql
use company;
Select * from department;

 * mysql+pymysql://root:***@localhost/
0 rows affected.
6 rows affected.

[('Headquarters', 1, '888665555', datetime.date(1971, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1985, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1978, 5, 22)),
 ('Software', 6, '111111100', datetime.date(1999, 5, 15)),
 ('Hardware', 7, '444444400', datetime.date(1998, 5, 15)),
 ('Sales', 8, '555555500', datetime.date(1997, 1, 1))]

### Q1 Creating View

Use the company database from the previous lab.

#### a) Create a view that summarizes the ssn, full name and salary of all employees from the Sales department. Show that the view has been created successfully.

In [5]:
%%sql
CREATE OR REPLACE VIEW Q1a AS
SELECT ssn, CONCAT(fname, ' ', minit, ' ', lname) as full_name, salary
FROM employee, department
WHERE dno = dnumber
AND dname = 'Sales';

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [6]:
%sql SELECT * FROM Q1a;

 * mysql+pymysql://root:***@localhost/
14 rows affected.

[('666666600', 'Bob B Bender', Decimal('96000.00')),
 ('666666601', 'Jill J Jarvis', Decimal('36000.00')),
 ('666666602', 'Kate W King', Decimal('44000.00')),
 ('666666603', 'Lyle G Leslie', Decimal('41000.00')),
 ('666666604', 'Billie J King', Decimal('38000.00')),
 ('666666605', 'Jon A Kramer', Decimal('41500.00')),
 ('666666606', 'Ray H King', Decimal('44500.00')),
 ('666666607', 'Gerald D Small', Decimal('29000.00')),
 ('666666608', 'Arnold A Head', Decimal('33000.00')),
 ('666666609', 'Helga C Pataki', Decimal('32000.00')),
 ('666666610', 'Naveen B Drew', Decimal('34000.00')),
 ('666666611', 'Carl E Reedy', Decimal('32000.00')),
 ('666666612', 'Sammy G Hall', Decimal('37000.00')),
 ('666666613', 'Red A Bacher', Decimal('33500.00'))]

#### b) Create a view that summarizes the max, min, average and total salary of employees in each department. Show that the view has been created successfully.

In [7]:
%%sql
CREATE OR REPLACE VIEW Q1b AS
SELECT dno, max(salary) as max, min(salary) as min, avg(salary) as average, sum(salary) as total
FROM employee
GROUP BY dno

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [8]:
%sql SELECT * FROM Q1b;

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[(1, Decimal('55000.00'), Decimal('55000.00'), Decimal('55000.000000'), Decimal('55000.00')),
 (4, Decimal('43000.00'), Decimal('25000.00'), Decimal('31000.000000'), Decimal('93000.00')),
 (5, Decimal('40000.00'), Decimal('25000.00'), Decimal('33250.000000'), Decimal('133000.00')),
 (6, Decimal('85000.00'), Decimal('40000.00'), Decimal('60000.000000'), Decimal('480000.00')),
 (7, Decimal('92000.00'), Decimal('43000.00'), Decimal('63450.000000'), Decimal('634500.00')),
 (8, Decimal('96000.00'), Decimal('29000.00'), Decimal('40821.428571'), Decimal('571500.00'))]

#### c) Create two new users in the DBMS. Grant `user1` SELECT privilege to the view in (a) created above and `user2` SELECT privilege to the view in (b). 

#### <font color='red'>Note that the authorization grant commands are covered on page 9 of Chapter 7 notes.</font>

You should test the code by logging in using the users created above. 
* Perform some queries on the view they are assigned to. 
* Can user1 query on view in (b)?
* Try to access the EMPLOYEE table, what happens?

In [9]:
%%sql
DROP USER IF EXISTS 'user1'@'localhost';
DROP USER IF EXISTS 'user2'@'localhost';

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql
CREATE USER 'user1'@'localhost' IDENTIFIED by 'user1';
CREATE USER 'user2'@'localhost' IDENTIFIED by 'user2';
GRANT SELECT ON company.Q1a TO 'user1'@'localhost';
GRANT SELECT ON company.Q1b TO 'user2'@'localhost';

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [11]:
%sql mysql+pymysql://user1:user1@localhost/

In [12]:
%%sql
USE company;
SELECT * FROM employee;

   mysql+pymysql://root:***@localhost/
 * mysql+pymysql://user1:***@localhost/
0 rows affected.
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'user1'@'localhost' for table 'employee'")
[SQL: SELECT * FROM employee;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [13]:
%sql mysql+pymysql://user2:user2@localhost/

In [14]:
%%sql
USE company;
SELECT * FROM Q1b;

   mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
 * mysql+pymysql://user2:***@localhost/
0 rows affected.
6 rows affected.

[(1, Decimal('55000.00'), Decimal('55000.00'), Decimal('55000.000000'), Decimal('55000.00')),
 (4, Decimal('43000.00'), Decimal('25000.00'), Decimal('31000.000000'), Decimal('93000.00')),
 (5, Decimal('40000.00'), Decimal('25000.00'), Decimal('33250.000000'), Decimal('133000.00')),
 (6, Decimal('85000.00'), Decimal('40000.00'), Decimal('60000.000000'), Decimal('480000.00')),
 (7, Decimal('92000.00'), Decimal('43000.00'), Decimal('63450.000000'), Decimal('634500.00')),
 (8, Decimal('96000.00'), Decimal('29000.00'), Decimal('40821.428571'), Decimal('571500.00'))]

In [15]:
%%sql
mysql+pymysql://root:admin@localhost/
USE company;

0 rows affected.

[]

### Q2 Schedule Event

Using the company database, create a scheduled event that will add $10 to the salary of all employees per minute, for an interval of 5 mins.

In [16]:
%%sql
SET GLOBAL event_scheduler = ON;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.

[]

In [17]:
%sql DROP EVENT IF EXISTS unrealistic_situation

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.

[]

In [18]:
%%sql
CREATE EVENT unrealistic_situation
ON SCHEDULE EVERY 1 MINUTE
STARTS CURRENT_TIMESTAMP
ENDS CURRENT_TIMESTAMP + INTERVAL 5 MINUTE
DO
  UPDATE employee
  SET salary = salary + 10;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.

[]

### Q3 Stored Procedures

#### a) Create a stored procedure that returns the number of employees from a certain department that earns above a certain salary.

You will need to input the department NAME and salary into the procedure. The output will be the number of employees that meets the criteria.

Test the stored procedure created by calling it. Check if the returned output is correct.

In [19]:
%sql DROP PROCEDURE IF EXISTS ShowSalaryOver;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.

[]

In [20]:
%%sql
CREATE PROCEDURE ShowSalaryOver(sal INT, depname VARCHAR(25))
    BEGIN
        SELECT count(salary) AS 'Output'
        FROM employee, department
        WHERE dno = dnumber AND salary > sal AND depname = dname
        GROUP BY dno;
    END;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.

[]

In [21]:
%sql CALL ShowSalaryOver(50000, 'Sales');

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
1 rows affected.

[(1,)]

#### b) Using user1 from Q1c), grant `user1` necessary privilege to run the stored procedure in (a). You may need to do some research on how to achieve this.

In [22]:
%%sql
GRANT EXECUTE ON PROCEDURE ShowSalaryOver TO 'user1'@'localhost';

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.

[]

In [23]:
%sql mysql+pymysql://user1:user1@localhost/

In [24]:
%%sql
USE company;
CALL ShowSalaryOver(50000, 'Sales');

   mysql+pymysql://root:***@localhost/
 * mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.
1 rows affected.

[(1,)]

In [25]:
%sql mysql+pymysql://root:admin@localhost/

### Q4 Triggers

We will use the SimpleCompany database below for this question. Execute the code below:

In [26]:
%%sql
drop database if exists simplecompany; 
create database simplecompany; 
use simplecompany; 

CREATE TABLE department (
  dname        varchar(25) not null,
  dno      	   integer(4) not null,
  total_sal	   decimal(10,2),
  mgrssn       char(9) not null,
  primary key (dno),
  unique (dname)
);

CREATE TABLE employee (
  name    varchar(15) not null, 
  ssn      char(9)  not null,
  salary   decimal(10,2),
  dno      integer(4),
  superssn char(9),
  primary key (ssn),
  foreign key (superssn) references employee(ssn),
  foreign key (dno) references department(dno)
);

INSERT INTO department VALUES ("Research","5",0,"333445555");
INSERT INTO department VALUES ("Administration","4",0,"987654321");
INSERT INTO department VALUES ("Headquarters","1",0,"888665555");
INSERT INTO department VALUES ("Software","6",0,"111111100");
INSERT INTO department VALUES ("Hardware","7",0,"444444400");
INSERT INTO department VALUES ("Sales","8",0,"555555500");

Select * from department;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
2 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
6 rows affected.

[('Headquarters', 1, Decimal('0.00'), '888665555'),
 ('Administration', 4, Decimal('0.00'), '987654321'),
 ('Research', 5, Decimal('0.00'), '333445555'),
 ('Software', 6, Decimal('0.00'), '111111100'),
 ('Hardware', 7, Decimal('0.00'), '444444400'),
 ('Sales', 8, Decimal('0.00'), '555555500')]

Excute the following script in your mysql command to insert the trigger.

In [27]:
%%sql
CREATE TRIGGER totalSal1 
AFTER INSERT ON EMPLOYEE
FOR EACH ROW 
UPDATE DEPARTMENT
SET total_sal = total_sal + NEW.salary
WHERE DNO = NEW.DNO;
       
CREATE TRIGGER totalSal2n3
AFTER UPDATE ON EMPLOYEE
FOR EACH ROW 
BEGIN
UPDATE DEPARTMENT
SET total_sal = total_sal + NEW.salary
WHERE DNO = NEW.DNO;

UPDATE DEPARTMENT
SET total_sal = total_sal - OLD.salary
WHERE DNO = OLD.DNO;
END;   

CREATE TRIGGER totalSal4
AFTER DELETE ON EMPLOYEE
FOR EACH ROW 
UPDATE DEPARTMENT
SET total_sal = total_sal - OLD.salary
WHERE DNO = OLD.DNO;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.

[]

Run the following commands one by one. Observe the values in total_sal after you run each command.

In [28]:
%%sql
INSERT INTO EMPLOYEE VALUES ("Brad","111111103","44000","6","111111103");
select * from department;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
1 rows affected.
6 rows affected.

[('Headquarters', 1, Decimal('0.00'), '888665555'),
 ('Administration', 4, Decimal('0.00'), '987654321'),
 ('Research', 5, Decimal('0.00'), '333445555'),
 ('Software', 6, Decimal('44000.00'), '111111100'),
 ('Hardware', 7, Decimal('0.00'), '444444400'),
 ('Sales', 8, Decimal('0.00'), '555555500')]

In [29]:
%%sql
INSERT INTO EMPLOYEE VALUES ("Evan","222222200","92000","7","111111103");
select * from department;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
1 rows affected.
6 rows affected.

[('Headquarters', 1, Decimal('0.00'), '888665555'),
 ('Administration', 4, Decimal('0.00'), '987654321'),
 ('Research', 5, Decimal('0.00'), '333445555'),
 ('Software', 6, Decimal('44000.00'), '111111100'),
 ('Hardware', 7, Decimal('92000.00'), '444444400'),
 ('Sales', 8, Decimal('0.00'), '555555500')]

In [30]:
%%sql
INSERT INTO EMPLOYEE VALUES ("Jared","111111100","85000","6","111111103");
select * from department;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
1 rows affected.
6 rows affected.

[('Headquarters', 1, Decimal('0.00'), '888665555'),
 ('Administration', 4, Decimal('0.00'), '987654321'),
 ('Research', 5, Decimal('0.00'), '333445555'),
 ('Software', 6, Decimal('129000.00'), '111111100'),
 ('Hardware', 7, Decimal('92000.00'), '444444400'),
 ('Sales', 8, Decimal('0.00'), '555555500')]

Note that the value of total_sal is updated each time a new tuple is added into EMPLOYEE table due to the existence of the trigger.

#### a) Test trigger `totalSal2n3` and `totalSal4` by updating or deleting tuples from the employee table accordingly.

In [31]:
%%sql
UPDATE employee
SET salary = 1000
WHERE name = 'Evan';
SELECT * FROM department;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
1 rows affected.
6 rows affected.

[('Headquarters', 1, Decimal('0.00'), '888665555'),
 ('Administration', 4, Decimal('0.00'), '987654321'),
 ('Research', 5, Decimal('0.00'), '333445555'),
 ('Software', 6, Decimal('129000.00'), '111111100'),
 ('Hardware', 7, Decimal('1000.00'), '444444400'),
 ('Sales', 8, Decimal('0.00'), '555555500')]

#### b) Now add another derived column named num_employees. This column will store the total number of employees from a department in the department table. Write relevant triggers such that the total number of employees for the department will be updated whenever changes are made to employees in a department (via insert, delete and update).

Please note that following:
* After adding num_employees column, please use an update statement to set the values of this column correctly.
* Test your triggers with relevant insert, update and delete statements. 
* Log your results to show the “before” and “after”.

In [32]:
%%sql
ALTER TABLE department ADD num_employees INT;
SELECT * FROM department;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.
6 rows affected.

[('Headquarters', 1, Decimal('0.00'), '888665555', None),
 ('Administration', 4, Decimal('0.00'), '987654321', None),
 ('Research', 5, Decimal('0.00'), '333445555', None),
 ('Software', 6, Decimal('129000.00'), '111111100', None),
 ('Hardware', 7, Decimal('1000.00'), '444444400', None),
 ('Sales', 8, Decimal('0.00'), '555555500', None)]

In [33]:
%%sql
UPDATE department
SET num_employees = (
    SELECT COUNT(name)
    FROM employee
    WHERE dno = 1) 
WHERE dno = 1;
UPDATE department
SET num_employees = (
    SELECT COUNT(name)
    FROM employee
    WHERE dno = 4) 
WHERE dno = 4;
UPDATE department
SET num_employees = (
    SELECT COUNT(name)
    FROM employee
    WHERE dno = 5) 
WHERE dno = 5;
UPDATE department
SET num_employees = (
    SELECT COUNT(name)
    FROM employee
    WHERE dno = 6) 
WHERE dno = 6;
UPDATE department
SET num_employees = (
    SELECT COUNT(name)
    FROM employee
    WHERE dno = 7) 
WHERE dno = 7;
UPDATE department
SET num_employees = (
    SELECT COUNT(name)
    FROM employee
    WHERE dno = 8) 
WHERE dno = 8;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [34]:
%%sql
CREATE TRIGGER Q4bINSERT
AFTER INSERT ON employee
FOR EACH ROW
UPDATE department
SET num_employees = num_employees + 1
WHERE dno = NEW.dno;

CREATE TRIGGER Q4bDELTE
AFTER DELETE ON employee
FOR EACH ROW
UPDATE department
SET num_employees = num_employees - 1
WHERE dno = OLD.dno;

SELECT * FROM department;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.
0 rows affected.
6 rows affected.

[('Headquarters', 1, Decimal('0.00'), '888665555', 0),
 ('Administration', 4, Decimal('0.00'), '987654321', 0),
 ('Research', 5, Decimal('0.00'), '333445555', 0),
 ('Software', 6, Decimal('129000.00'), '111111100', 2),
 ('Hardware', 7, Decimal('1000.00'), '444444400', 1),
 ('Sales', 8, Decimal('0.00'), '555555500', 0)]

In [35]:
%%sql
START TRANSACTION;
INSERT INTO employee (name, ssn, salary, dno, superssn)
VALUES ('test1', '111111111', 60000.00, 1, NULL);
INSERT INTO employee (name, ssn, salary, dno, superssn)
VALUES ('test2', '222222222', 50000.00, 1, NULL);
COMMIT;

SELECT * FROM department;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.
6 rows affected.

[('Headquarters', 1, Decimal('110000.00'), '888665555', 2),
 ('Administration', 4, Decimal('0.00'), '987654321', 0),
 ('Research', 5, Decimal('0.00'), '333445555', 0),
 ('Software', 6, Decimal('129000.00'), '111111100', 2),
 ('Hardware', 7, Decimal('1000.00'), '444444400', 1),
 ('Sales', 8, Decimal('0.00'), '555555500', 0)]

#### c) We want to ensure that a department always has at least one employee. We can try to enforce this using a BEFORE DELETE trigger. 

How the trigger should work:
* Before an employee is deleted, the trigger checks how many employees are in their department.
* If there’s only one employee left, the deletion is blocked.
* This ensures that a department never becomes empty.

Write a trigger to achieve this.

In [36]:
%%sql
CREATE TRIGGER LastEmployeeCheck 
BEFORE DELETE ON employee
FOR EACH ROW
BEGIN
    DECLARE employee_count INT;
    SELECT num_employees INTO employee_count
    FROM department
    WHERE dno = OLD.dno;
    IF employee_count = 1
        THEN SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'The last one';
    END IF;
END;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.

[]

Write relevant code to show that the trigger works.

In [37]:
%%sql
DELETE FROM employee WHERE name = 'Evan';

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
(pymysql.err.OperationalError) (1644, 'The last one')
[SQL: DELETE FROM employee WHERE name = 'Evan';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### Q5 Insert, Update, Delete

#### a) Write an SQL query to update the salary of employees working on the "ProductY" project. Use a nested SELECT statement to identify the employees (essn) who are working on this project and then increase their salary by 10%. Show the update is successful.

In [38]:
%%sql
USE company;
SELECT *
FROM employee
WHERE ssn IN (
    SELECT essn
    FROM works_on, project
    WHERE pno = pnumber
    AND pname = 'ProductY'
)

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
0 rows affected.
3 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1955, 1, 9), '731 Fondren, Houston, TX', 'M', Decimal('30010.00'), '333333300', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('40010.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1962, 7, 31), '5631 Rice, Houston, TX', 'F', Decimal('25010.00'), '333333300', 5)]

In [39]:
%%sql
UPDATE employee
SET salary = salary * 1.10
WHERE ssn IN (
    SELECT essn
    FROM works_on, project
    WHERE pno = pnumber
    AND pname = 'ProductY'
);

SELECT *
FROM employee
WHERE ssn IN (
    SELECT essn
    FROM works_on, project
    WHERE pno = pnumber
    AND pname = 'ProductY'
)

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
3 rows affected.
3 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1955, 1, 9), '731 Fondren, Houston, TX', 'M', Decimal('33011.00'), '333333300', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('44011.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1962, 7, 31), '5631 Rice, Houston, TX', 'F', Decimal('27511.00'), '333333300', 5)]

#### b) Write an SQL query to insert the "Special Initiative" project into the project table, but only if there are employees who have worked more than 40 total hours on projects. 

The information to insert is `'Special Initiative', 999, 'HQ', 1`.

In [40]:
%%sql
INSERT INTO project (pname, pnumber, plocation, dnum)
SELECT 'Special Initiative', 999, 'HQ', 1
WHERE EXISTS(
    SELECT SUM(hours)
    FROM works_on
    GROUP BY essn
    HAVING SUM(hours) >= 40
);

SELECT * FROM project;

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
1 rows affected.
11 rows affected.

[('ProductY', 2, 'Sugarland', 5),
 ('ProductZ', 3, 'Houston', 5),
 ('Computerization', 10, 'Stafford', 4),
 ('Reorganization', 20, 'Houston', 1),
 ('Newbenefits', 30, 'Stafford', 4),
 ('OperatingSystems', 61, 'Jacksonville', 6),
 ('DatabaseSystems', 62, 'Birmingham', 6),
 ('Middleware', 63, 'Jackson', 6),
 ('InkjetPrinters', 91, 'Phoenix', 7),
 ('LaserPrinters', 92, 'LasVegas', 7),
 ('Special Initiative', 999, 'HQ', 1)]

#### c) Write an SQL query to insert employees who have worked more than 40 hours across all projects into the "Special Initiative" project (i.e. insert corresponding entries for them into the works_on table for the "Special Initiative" project.

In [44]:
%%sql
INSERT INTO works_on (essn, pno, hours)
SELECT essn , 999, 0
FROM works_on
GROUP BY essn
HAVING SUM(hours) >= 40

 * mysql+pymysql://root:***@localhost/
   mysql+pymysql://user1:***@localhost/
   mysql+pymysql://user2:***@localhost/
34 rows affected.

[]

### Submission Instructions

<div class="alert alert-block alert-info">
    
#### Upload to Coursemology

Upload the `.ipynb` to Coursemology. Name the file in the following format: `Lab<num><YourName>.ipynb`.

#### Print to OneNote

Print the `.ipynb` to OneNote > Individual Student Space > Lab folder
    
</div>

<hr>
© NUS High School of Math & Science